{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,20],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":1879,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":20,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,20]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.3,"recurrent_dropout":0.2,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["embedding_Embedding1",0,0,{}]]]},{"name":"bidirectional_Bidirectional2","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"recurrent_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.3,"recurrent_dropout":0.2,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"category_branch","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"category_branch","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"subcategory_branch","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"subcategory_branch","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["category_branch",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["subcategory_branch",0,0,{}]]]},{"name":"category_output","class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"category_output","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"subcategory_output","class_name":"Dense","config":{"units":7,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"subcategory_output","trainable":true},"inbound_nodes":[[["dropout_Dropout5",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["category_output",0,0],["subcategory_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[1879,64],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/kernel","shape":[128,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"category_branch/kernel","shape":[32,32],"dtype":"float32"},{"name":"category_branch/bias","shape":[32],"dtype":"float32"},{"name":"subcategory_branch/kernel","shape":[32,64],"dtype":"float32"},{"name":"subcategory_branch/bias","shape":[64],"dtype":"float32"},{"name":"category_output/kernel","shape":[32,2],"dtype":"float32"},{"name":"category_output/bias","shape":[2],"dtype":"float32"},{"name":"subcategory_output/kernel","shape":[64,7],"dtype":"float32"},{"name":"subcategory_output/bias","shape":[7],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}